Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/pdm_pcm.c
/******************************************************************************
* File Name:   dev_pdm_pcm.c
*
* Description: This file implements the PDM/PCM peripheral for PSOC Edge using 
* Peripheral Driver Layer (PDL) APIs.
*
* Related Document: See README.md
*
*******************************************************************************
* Copyright 2025, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/
#ifdef IM_ENABLE_PDM_PCM
#include "cy_pdm_pcm_v2.h"
#include "pdm_pcm.h"

/******************************************************************************
 * Macros
 *****************************************************************************/
/* PDM PCM hardware FIFO size */
#define HW_FIFO_SIZE                            (64u)

/* Rx FIFO trigger level/threshold configured by user */
#define RX_FIFO_TRIG_LEVEL                      (HW_FIFO_SIZE/2)

/* Total number of interrupts to get the FRAME_SIZE number of samples*/
#define NUMBER_INTERRUPTS_FOR_FRAME             ((FRAME_SIZE)/RX_FIFO_TRIG_LEVEL)

/* PDM PCM interrupt priority */
#define PDM_PCM_ISR_PRIORITY                    (2u)

/* Decimation Rate of the PDM/PCM block. Typical value is 64 */
#define DECIMATION_RATE             (64u)

/* Define how many samples in a frame */
#define FRAME_SIZE                  (1024)

/* Define the DPLL Configurations */
#define DPLL_INPUT_FREQ_HZ          (17203200UL)
#define DPLL_OUTPUT1_FREQ_HZ        (73728000UL)
#define DPLL_OUTPUT2_FREQ_HZ        (169344000UL)
#define DPLL_ENABLE_TIMEOUT_MS      (10000U)

#ifdef INCLUDE_STRINGS
const char* sample_rate_string_list[] =  { "8 kHz", "16 kHz", "22.05 kHz", "44.1 kHz", "48 kHz" };

const char* gain_option_list[] = {"83 dB", "77 dB", "71 dB", "65 dB","59 dB", "53 dB", "47 dB",
                                  "41 dB", "35 dB","29 dB","23 dB","17 dB","11 dB",
                                 "5 dB","-1 dB","-7 dB","-13 dB","-19 dB","-25 dB",
                                 "-31 dB","-37 dB","-43 dB","-49 dB","-55 dB","-61 dB",
                                 "-67 dB","-73 dB","-79 dB","-85 dB","-91 dB",
                                 "-97 dB","-103 dB"};
#endif 
/******************************************************************************
 * Type Definitions
 *****************************************************************************/

typedef struct pdm_pcm_t
{
    uint8_t index;
    int16_t audio_buffer0[FRAME_SIZE];
    int16_t audio_buffer1[FRAME_SIZE];
    int16_t* active_rx_buffer;
    int16_t* full_rx_buffer;
    PDM_PCM_CONFIG_t * config;
    cy_en_pdm_pcm_gain_sel_t gain[MAX_CHANNEL_COUNT_PER_HANDLE];
    bool is_used;
    bool pdm_pcm_initialized;
    bool have_data;
    int skipped_frames;
    int init_discard_counter;
} pdm_pcm_t;


struct pdm_pcm_t pool_of_mics[MAX_HANDLE_COUNT] = {0};

SAMPLE_RATE pdm_pcm_sample_rate = SAMPLE_RATE_48000;

static void pdm_pcm_event_handler_0(void);
static void pdm_pcm_event_handler_1(void);

void (*event_handlers[MAX_HANDLE_COUNT])(void) = 
{   pdm_pcm_event_handler_0, 
    pdm_pcm_event_handler_1};


/*******************************************************************************
* Function Name: dpll_lp_set_freq
********************************************************************************
* Summary:
*    A function used to update the DPLL LP 1 frequency.
*
* Parameters:
*   sample_rate: Desired DPLL LP 1 frequency.
*
* Return:
*
*******************************************************************************/
static void dpll_lp_set_freq(uint32_t freq)
{
    cy_stc_pll_config_t dpll_lp1;

    /* Check if the current DPLL_LP_1 frequency is same as 'freq' */
    if (Cy_SysClk_PllGetFrequency(SRSS_DPLL_LP_1_PATH_NUM) == freq)
    {
        printf("DPLL_LP_1 is already set to the desired frequency: %lu Hz\n", (unsigned long int)freq);
        return;
    }

    /* Set the DPLL_LP_1 PLL configurations */
    dpll_lp1.inputFreq = DPLL_INPUT_FREQ_HZ;
    dpll_lp1.outputFreq = freq;
    dpll_lp1.outputMode = CY_SYSCLK_FLLPLL_OUTPUT_AUTO;
    dpll_lp1.lfMode = false;

    /* Disable the DPLL_LP_1 PLL path */
    Cy_SysClk_PllDisable(SRSS_DPLL_LP_1_PATH_NUM);

    /* Configure the PLL with the specified settings */
    if (CY_SYSCLK_SUCCESS !=
            Cy_SysClk_PllConfigure(SRSS_DPLL_LP_1_PATH_NUM, &dpll_lp1))
    {
        printf("Failed to configure DPLL LP1\r\n");
        CY_ASSERT(0);
    }

    /* Enable the DPLL_LP_1 PLL path with a timeout */
    if (CY_SYSCLK_SUCCESS !=
            Cy_SysClk_PllEnable(SRSS_DPLL_LP_1_PATH_NUM, DPLL_ENABLE_TIMEOUT_MS))
    {
        /* Handle error if PLL enable fails */
        printf("Failed to enable DPLL LP1\r\n");
        CY_ASSERT(0);
    }
}

