Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/pdm_pcm.c
/******************************************************************************
* Function Name: pdm_pcm_set_gain
*******************************************************************************/
/**
*
* Updates the gain value setting in the given PDM-PCM instance. The gain will be 
* applied when pdm_pcm_start is invoked. 
*
* \param handle
* The pointer to the PDM-PCM instance handle.
*
* \param channel_num
* The channel number for gain setting.
*
* \param gain
* Gain value defined as cy_en_pdm_pcm_gain_sel_t
*
******************************************************************************/
PDM_PCM_STATUS_t pdm_pcm_set_gain (pdm_pcm handle, uint8_t channel_num, cy_en_pdm_pcm_gain_sel_t gain)
{

    if (NULL == handle)
    {
        return PDM_PCM_STATUS_BAD_PARAM;
    }

    for (uint8_t ch_idx = 0; ch_idx < (handle->config->mode+1); ch_idx++)
    {
        if (handle->config->channel_index_list[ch_idx] == channel_num)
        {
            handle->gain[ch_idx] = gain;
            return PDM_PCM_STATUS_SUCCESS;
        }
    }
    
    return PDM_PCM_STATUS_BAD_PARAM;
}

/*******************************************************************************
* Function Name: pdm_pcm_init_hw
********************************************************************************
* Summary:
*    A function used to initialize and configure the PDM to PCM converter and 
*    the clocks that source it.
*
* Parameters:
*   sample_rate: Desired Sample Rate for the converter.
*
* Return:
*     The status of the initialization.
*
*******************************************************************************/
PDM_PCM_STATUS_t pdm_pcm_init_hw(SAMPLE_RATE sample_rate)
{
    pdm_pcm_sample_rate = sample_rate;

    if ( (SAMPLE_RATE_8000 == sample_rate) || (SAMPLE_RATE_16000 == sample_rate) ||
         (SAMPLE_RATE_48000 == sample_rate) )
    {
        dpll_lp_set_freq(DPLL_OUTPUT1_FREQ_HZ);
    }
    else if ( (SAMPLE_RATE_22050 == sample_rate) || (SAMPLE_RATE_44100 == sample_rate) )
    {
        dpll_lp_set_freq(DPLL_OUTPUT2_FREQ_HZ);
    }
    else
    {
        printf("Invalid Sample Rate\r\n");
        return PDM_PCM_STATUS_BAD_PARAM;
    }

    /* Set the clock dividers for the selected sample rate */
    Cy_SysClk_PeriPclkDisableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U);
    switch(sample_rate)
    {
        case SAMPLE_RATE_8000:
        {
            Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U, 11U, 0U);
            break;
        }
        case SAMPLE_RATE_16000:
        {
            Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U, 5U, 0U);
            break;
        }
        case SAMPLE_RATE_48000:
        {
            Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U, 1U, 0U);
            break;
        }
        case SAMPLE_RATE_22050:
        {
            Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U, 9U, 0u);
            break;
        }
        case SAMPLE_RATE_44100:
        {
            Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U, 4U, 0U);
            break;
        }
    }
    Cy_SysClk_PeriPclkEnableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U);

    return PDM_PCM_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: pdm_pcm_create
********************************************************************************
* Summary:
*    A function used to create an instance of the PDM-PCM interface.
*
* Parameters:
*   config: Channel configuration.
*
* Return:
*     A handle to the PDM-PCM interface.
*
*******************************************************************************/
pdm_pcm pdm_pcm_create(PDM_PCM_CONFIG_t * config)
{
    pdm_pcm mic_handle = NULL;
    for (uint8_t i = 0; i < 2; i++)
    {
        if (false == pool_of_mics[i].is_used)
        {
            mic_handle = &pool_of_mics[i];
            mic_handle->config = config;
            mic_handle->index = i;
            break;
        }
    }

    return mic_handle;
}

/*******************************************************************************
* Function Name: pdm_pcm_update_config
********************************************************************************
* Summary:
*    A function used to modify the PDM-PCM configuration of a given instance. 
*
* Parameters:
*   config: config to be used after function is invoked.
*
* Return:
*     The status of the operation.
*
*******************************************************************************/
PDM_PCM_STATUS_t pdm_pcm_update_config(pdm_pcm handle, PDM_PCM_CONFIG_t * config)
{
    if (NULL == handle)
    {
        return PDM_PCM_STATUS_BAD_PARAM;
    }

    handle->config = config;

    return PDM_PCM_STATUS_SUCCESS;
}
/*******************************************************************************
* Function Name: pdm_pcm_event_handler
********************************************************************************
* Summary:
*  PDM/PCM ISR handler. Check the interrupt status and clears it.
*  Fills a buffer and then swaps that buffer with an empty one.
*  Once a buffer is full, a flag is set which is used in main.
*
* Parameters:
*  handle: Handle for the PDM-PCM interface.
*
* Return:
*  None
*
*******************************************************************************/
static void pdm_pcm_event_handler(pdm_pcm handle)
{
    PDM_PCM_CONFIG_t*  config = handle->config;
    uint8_t num_channels = config->mode + 1;
    uint8_t int_channel_index = config->pdm_irq_cfg.intrSrc - pdm_0_interrupts_0_IRQn;

    /* Used to track how full the buffer is */
    static uint16_t frame_counter = 0;

    /* Check the interrupt status */
    uint32_t intr_status = Cy_PDM_PCM_Channel_GetInterruptStatusMasked(CYBSP_PDM_HW, int_channel_index);
    if(CY_PDM_PCM_INTR_RX_TRIGGER & intr_status)
    {
        /* Move data from the PDM fifo and place it in a buffer */
        uint32_t index = 0;
        for(uint32_t i=0; i < (RX_FIFO_TRIG_LEVEL/num_channels); i++)
        {
            for(uint8_t ch_idx = 0; ch_idx < num_channels; ch_idx++)
            {
                int32_t data = (int32_t)Cy_PDM_PCM_Channel_ReadFifo(CYBSP_PDM_HW, config->channel_index_list[ch_idx]);
                handle->active_rx_buffer[frame_counter * RX_FIFO_TRIG_LEVEL + index] = (int16_t)(data);
                index++;
            }
        }
        Cy_PDM_PCM_Channel_ClearInterrupt(CYBSP_PDM_HW, int_channel_index, CY_PDM_PCM_INTR_RX_TRIGGER);
        frame_counter++;
    }
    /* Check if the buffer is full */
    if((NUMBER_INTERRUPTS_FOR_FRAME) <= frame_counter)
    {
        /* Flip the active and the next rx buffers */
        int16_t* temp = handle->active_rx_buffer;
        handle->active_rx_buffer = handle->full_rx_buffer;
        handle->full_rx_buffer = temp;

        /* Set the have_data flag as true, signaling there is data ready for use */
        handle->have_data = true;
        frame_counter = 0;
    }

