Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/pdm_pcm.c
    if((CY_PDM_PCM_INTR_RX_FIR_OVERFLOW | CY_PDM_PCM_INTR_RX_OVERFLOW|
            CY_PDM_PCM_INTR_RX_IF_OVERFLOW | CY_PDM_PCM_INTR_RX_UNDERFLOW) & intr_status)
    {
        Cy_PDM_PCM_Channel_ClearInterrupt(CYBSP_PDM_HW, int_channel_index, CY_PDM_PCM_INTR_MASK);
    }
}

/*******************************************************************************
* Function Name: pdm_pcm_event_handler_0
********************************************************************************
* Summary:
*  PDM/PCM ISR handler for the first instance of the interface in the pool. 
*
* Parameters:
*
* Return:
*  None
*
*******************************************************************************/
static void pdm_pcm_event_handler_0(void)
{
    pdm_pcm_event_handler(&pool_of_mics[0]);
}

/*******************************************************************************
* Function Name: pdm_pcm_event_handler_1
********************************************************************************
* Summary:
*  PDM/PCM ISR handler for the second instance of the interface in the pool. 
*
* Parameters:
*
* Return:
*  None
*
*******************************************************************************/
static void pdm_pcm_event_handler_1(void)
{
    pdm_pcm_event_handler(&pool_of_mics[1]);
}
/*******************************************************************************
* Function Name: pdm_pcm_start
********************************************************************************
* Summary:
*    A function to start the PDM-PCM converter for a given handle. 
*
* Parameters:
*   handle: Handle for the PDM-PCM interface.
*
* Return:
*     The status of the operation.
*
*******************************************************************************/
PDM_PCM_STATUS_t pdm_pcm_start(pdm_pcm handle)
{
    cy_rslt_t result;

    if (NULL == handle)
    {
        return PDM_PCM_STATUS_BAD_PARAM;
    }

    PDM_PCM_CONFIG_t*  config = handle->config;
    uint8_t int_channel_index = config->pdm_irq_cfg.intrSrc - pdm_0_interrupts_0_IRQn;

    /* Stop and free the device if running */
    result = pdm_pcm_stop(handle);
    if (CY_RSLT_SUCCESS != result)
    {
        return PDM_PCM_STATUS_FAIL;
    }

    /* Set up pointers to two buffers to implement a ping-pong buffer system.
     * One gets filled by the PDM while the other can be processed. */
    memset(handle->audio_buffer0, 0, FRAME_SIZE*sizeof(int16_t));
    memset(handle->audio_buffer1, 0, FRAME_SIZE*sizeof(int16_t));
    handle->active_rx_buffer = handle->audio_buffer0;
    handle->full_rx_buffer = handle->audio_buffer1;
    handle->have_data = false;
    handle->init_discard_counter = 4; /* Skip the first 4 frames. */


    /* Initialize PDM/PCM block */
    cy_en_pdm_pcm_status_t status = Cy_PDM_PCM_Init(CYBSP_PDM_HW, &CYBSP_PDM_config);
    
    if(CY_PDM_PCM_SUCCESS != status)
    {
        return PDM_PCM_STATUS_FAIL;
    }

    /* Initialize PDM/PCM channels */
    for (uint8_t i = 0; i < (config->mode+1); i++)
    {
        Cy_PDM_PCM_Channel_Enable(CYBSP_PDM_HW, config->channel_index_list[i]);
        Cy_PDM_PCM_Channel_Init(CYBSP_PDM_HW, &config->channel_config[i], config->channel_index_list[i]);
        Cy_PDM_PCM_SetGain(CYBSP_PDM_HW, config->channel_index_list[i], handle->gain[i]);
    }

    /* An interrupt is registered for right channel, clear and set masks for it. */
    Cy_PDM_PCM_Channel_ClearInterrupt(CYBSP_PDM_HW, int_channel_index, CY_PDM_PCM_INTR_MASK);
    Cy_PDM_PCM_Channel_SetInterruptMask(CYBSP_PDM_HW, int_channel_index, CY_PDM_PCM_INTR_MASK);

    config->pdm_irq_cfg.intrPriority = PDM_PCM_ISR_PRIORITY;
    /* Register the IRQ handler */
    result = Cy_SysInt_Init(&config->pdm_irq_cfg, event_handlers[handle->index]);
    if(CY_SYSINT_SUCCESS != result)
    {
        return PDM_PCM_STATUS_FAIL;
    }
    NVIC_ClearPendingIRQ(config->pdm_irq_cfg.intrSrc);
    NVIC_EnableIRQ(config->pdm_irq_cfg.intrSrc);

    /* Global variable used to determine if PDM data is available */
    handle->have_data = false;

    /* Set up pointers to two buffers to implement a ping-pong buffer system.
     * One gets filled by the PDM while the other can be processed. */
    handle->active_rx_buffer = handle->audio_buffer0;
    handle->full_rx_buffer = handle->audio_buffer1;

    for (uint8_t i = 0; i < (config->mode+1); i++)
    {
        Cy_PDM_PCM_Activate_Channel(CYBSP_PDM_HW, config->channel_index_list[i]);
    }

    handle->pdm_pcm_initialized = true;

    char* mode_string[] = {"Mono", "Stereo"};

    cy_en_pdm_pcm_gain_sel_t fir1_ctl = _FLD2VAL(PDM_CH_FIR1_CTL_SCALE, PDM_PCM_CH_FIR1_CTL(CYBSP_PDM_HW, config->channel_index_list[0]));

    printf("pdm_pcm: Configured device mode=%s, sample rate=%s, gain=%s\r\n", 
                mode_string[config->mode], 
                sample_rate_string_list[pdm_pcm_sample_rate],
            gain_option_list[(fir1_ctl)]);


    return PDM_PCM_STATUS_SUCCESS;
}
/*******************************************************************************
* Function Name: pdm_pcm_stop
********************************************************************************
* Summary:
*    A function to stop the PDM-PCM converter for a given handle. 
*
* Parameters:
*   handle: Handle for the PDM-PCM interface.
*
* Return:
*     The status of the operation.
*
*******************************************************************************/
PDM_PCM_STATUS_t pdm_pcm_stop(pdm_pcm handle)
{
    if (NULL == handle)
    {
        return PDM_PCM_STATUS_BAD_PARAM;
    }

    PDM_PCM_CONFIG_t*  config = handle->config;
    if(handle->pdm_pcm_initialized) 
    {
        handle->pdm_pcm_initialized = false;
        for (uint8_t i = 0; i < (config->mode+1); i++)
        {
            Cy_PDM_PCM_DeActivate_Channel(CYBSP_PDM_HW, config->channel_index_list[i]);
        }
    }

    return PDM_PCM_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: pdm_pcm_data_ready
********************************************************************************
* Summary:
*    A function that returns the status of the full buffer.  
*
* Parameters:
*   handle: Handle for the PDM-PCM interface.
*
* Return:
*     The status of the full buffer.
*
*******************************************************************************/
bool pdm_pcm_data_ready(pdm_pcm handle)
{
    return handle->have_data;
}

