Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/pdm_pcm.c
/*******************************************************************************
* Function Name: pdm_pcm_discard_samples
********************************************************************************
* Summary:
*    A function that discards the first 4 samples after sampling has started.  
*
* Parameters:
*   handle: Handle for the PDM-PCM interface.
*
* Return:
*
*******************************************************************************/
void pdm_pcm_discard_samples(pdm_pcm handle)
{
    if ( handle->init_discard_counter > 0)
    {
        handle->init_discard_counter--;
        memset(handle->full_rx_buffer,0,FRAME_SIZE*sizeof(int16_t));
    }
}

/*******************************************************************************
* Function Name: pdm_pcm_get_full_buffer
********************************************************************************
* Summary:
*    A function that returns a pointer to the full buffer.  
*
* Parameters:
*   handle: Handle for the PDM-PCM interface.
*
* Return:
*    A pointer to the full buffer. 
*
*******************************************************************************/
int16_t* pdm_pcm_get_full_buffer(pdm_pcm handle)
{
    return handle->full_rx_buffer;
}

#ifdef INCLUDE_STRINGS
/*******************************************************************************
* Function Name: pdm_pcm_get_string_list_of_sample_rates
********************************************************************************
* Summary:
*    A function that returns a list of strings the indicate the available 
*    sample rates when using this module to configure the PDM-PCM converter. 
*
* Parameters:
*
* Return:
*    List of strings to label available sample rates. 
*
*******************************************************************************/
const char ** pdm_pcm_get_string_list_of_sample_rates(void)
{
    return sample_rate_string_list;
}

/*******************************************************************************
* Function Name: pdm_pcm_get_sample_rate_option_count
********************************************************************************
* Summary:
*    A function that returns how many sample rate options are available when
*    configuring the PDM-PCM converter with this module. 
*
* Parameters:
*
* Return:
*    Number of sample rate options available. 
*
*******************************************************************************/
uint8_t pdm_pcm_get_sample_rate_option_count(void)
{
    return SAMPLE_RATE_48000 + 1;
}

/*******************************************************************************
* Function Name: pdm_pcm_get_string_list_of_sample_rates
********************************************************************************
* Summary:
*    A function that returns a list of strings the indicate the available 
*    gain values when using this module to configure the PDM-PCM converter. 
*
* Parameters:
*
* Return:
*    List of strings to label available gain values. 
*
*******************************************************************************/
const char ** pdm_pcm_get_string_list_of_gain_options(void)
{
    return gain_option_list;
}

/*******************************************************************************
* Function Name: pdm_pcm_get_gain_option_count
********************************************************************************
* Summary:
*    A function that returns how many gain options are available when
*    configuring the PDM-PCM converter with this module. 
*
* Parameters:
*
* Return:
*    Number of gain options available. 
*
*******************************************************************************/
uint8_t pdm_pcm_get_gain_option_count(void)
{
    return CY_PDM_PCM_SEL_GAIN_NEGATIVE_103DB + 1;
}
#endif

/*******************************************************************************
* Function Name: pdm_pcm_get_frequency_from_frequency_index
********************************************************************************
* Summary:
*    A function that returns the sample rate as an integer based on the sample
*    rate option index input. 
*
* Parameters:
*    frequency_index: sample rate index selected. 
*
* Return:
*    sample rate in integer form. 
*
*******************************************************************************/
int pdm_pcm_get_frequency_from_frequency_index(SAMPLE_RATE frequency_index)
{
    int frequency;
    uint32_t frequency_options[SAMPLE_RATE_48000+1] = {8000, 16000, 22050, 44100, 48000};
    if ((SAMPLE_RATE_48000+1) > frequency_index)
    {
        frequency = frequency_options[frequency_index];
    }
    else 
    {
        /* Use default */
        frequency = frequency_options[0];
    }
    return frequency;
}

/*******************************************************************************
* Function Name: pdm_pcm_clear_data_ready_flag
********************************************************************************
* Summary:
*    A function that clears the data ready flag for a given handle.   
*
* Parameters:
*   handle: Handle for the PDM-PCM interface.
*
* Return:
*
*******************************************************************************/
void pdm_pcm_clear_data_ready_flag(pdm_pcm handle)
{
    handle->have_data = false;
}

/*******************************************************************************
* Function Name: pdm_pcm_get_frame_count
********************************************************************************
* Summary:
*    A function that returns the frame count size for a given handle.    
*
* Parameters:
*   handle: Handle for the PDM-PCM interface.
*
* Return:
*   frame count
*
*******************************************************************************/
uint32_t pdm_pcm_get_frame_count(pdm_pcm handle)
{
    uint8_t num_channels = handle->config->mode +1;
    return FRAME_SIZE / num_channels;
}

#endif /* IM_ENABLE_PDM_PCM */

/* [] END OF FILE */